blogger/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    flash.notice = "Article '#{@article.title}' Created!"

    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "another"], ["body", "here's another"], ["created_at", "2015-10-30 21:41:56.118579"], ["updated_at", "2015-10-30 21:41:56.118579"]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Testing the third article. Edited."], ["updated_at", "2015-10-30 23:35:49.941805"], ["id", 3]]