blogger/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "New comment"], ["body", "Hello... Writing comments :)"], ["article_id", 3], ["created_at", "2015-10-31 00:51:17.605402"], ["updated_at", "2015-10-31 00:51:17.605402"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]

    @comment.save